ProductStar/src/main/java/org/workwork/k_test/work_11_nagruz/work_1/starsships.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="MyTestPlan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="swapi" elementType="Argument">
            <stringProp name="Argument.name">swapi</stringProp>
            <stringProp name="Argument.value">swapi.dev</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Users">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="people2" enabled="true">
          <stringProp name="HTTPSampler.domain">${swapi}</stringProp>
          <stringProp name="HTTPSampler.path">/api/people/2/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;name&quot;: &quot;C-3PO&quot;,&#xd;
	&quot;height&quot;: &quot;167&quot;,&#xd;
	&quot;mass&quot;: &quot;75&quot;,&#xd;
	&quot;hair_color&quot;: &quot;n/a&quot;,&#xd;
	&quot;skin_color&quot;: &quot;gold&quot;,&#xd;
	&quot;eye_color&quot;: &quot;yellow&quot;,&#xd;
	&quot;birth_year&quot;: &quot;112BBY&quot;,&#xd;
	&quot;gender&quot;: &quot;n/a&quot;,&#xd;
	&quot;homeworld&quot;: &quot;https://swapi.dev/api/planets/1/&quot;,&#xd;
	&quot;films&quot;: [&#xd;
		&quot;https://swapi.dev/api/films/1/&quot;,&#xd;
		&quot;https://swapi.dev/api/films/2/&quot;,&#xd;
		&quot;https://swapi.dev/api/films/3/&quot;,&#xd;
		&quot;https://swapi.dev/api/films/4/&quot;,&#xd;
		&quot;https://swapi.dev/api/films/5/&quot;,&#xd;
		&quot;https://swapi.dev/api/films/6/&quot;&#xd;
	],&#xd;
	&quot;species&quot;: [&#xd;
		&quot;https://swapi.dev/api/species/2/&quot;&#xd;
	],&#xd;
	&quot;vehicles&quot;: [],&#xd;
	&quot;starships&quot;: [],&#xd;
	&quot;created&quot;: &quot;2014-12-10T15:10:51.357000Z&quot;,&#xd;
	&quot;edited&quot;: &quot;2014-12-20T21:17:50.309000Z&quot;,&#xd;
	&quot;url&quot;: &quot;https://swapi.dev/api/people/2/&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="starsships" enabled="true">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <stringProp name="HTTPSampler.domain">${swapi}</stringProp>
          <stringProp name="HTTPSampler.path">/api/starships/10/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;name&quot;: &quot;Millennium Falcon&quot;,&#xd;
	&quot;model&quot;: &quot;YT-1300 light freighter&quot;,&#xd;
	&quot;manufacturer&quot;: &quot;Corellian Engineering Corporation&quot;,&#xd;
	&quot;cost_in_credits&quot;: &quot;100000&quot;,&#xd;
	&quot;length&quot;: &quot;34.37&quot;,&#xd;
	&quot;max_atmosphering_speed&quot;: &quot;1050&quot;,&#xd;
	&quot;crew&quot;: &quot;4&quot;,&#xd;
	&quot;passengers&quot;: &quot;6&quot;,&#xd;
	&quot;cargo_capacity&quot;: &quot;100000&quot;,&#xd;
	&quot;consumables&quot;: &quot;2 months&quot;,&#xd;
	&quot;hyperdrive_rating&quot;: &quot;0.5&quot;,&#xd;
	&quot;MGLT&quot;: &quot;75&quot;,&#xd;
	&quot;starship_class&quot;: &quot;Light freighter&quot;,&#xd;
	&quot;pilots&quot;: [&#xd;
		&quot;https://swapi.dev/api/people/13/&quot;,&#xd;
		&quot;https://swapi.dev/api/people/14/&quot;,&#xd;
		&quot;https://swapi.dev/api/people/25/&quot;,&#xd;
		&quot;https://swapi.dev/api/people/31/&quot;&#xd;
	],&#xd;
	&quot;films&quot;: [&#xd;
		&quot;https://swapi.dev/api/films/1/&quot;,&#xd;
		&quot;https://swapi.dev/api/films/2/&quot;,&#xd;
		&quot;https://swapi.dev/api/films/3/&quot;&#xd;
	],&#xd;
	&quot;created&quot;: &quot;2014-12-10T16:59:45.094000Z&quot;,&#xd;
	&quot;edited&quot;: &quot;2014-12-20T21:23:49.880000Z&quot;,&#xd;
	&quot;url&quot;: &quot;https://swapi.dev/api/starships/10/&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="csv" enabled="true">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="${object}${number}" enabled="true">
          <stringProp name="HTTPSampler.domain">${swapi}</stringProp>
          <stringProp name="HTTPSampler.path">/api/${object}/${number}/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">C:/Users/steam/Desktop/data.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">object, number</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers"/>
        </HeaderManager>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Random" enabled="true">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="random${__Random(1,80,)}" enabled="true">
          <stringProp name="HTTPSampler.domain">${swapi}</stringProp>
          <stringProp name="HTTPSampler.path">/api/people/${__Random(1,80,)}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>